Tekla Open API Reference for Tekla Structures 2025
CrossSectionPoint Properties
The CrossSectionPoint type exposes the following members.
Properties
Name | Description
Chamfer
 The chamfer for the cross section point.
Top
See Also
Reference
CrossSectionPoint Class
Tekla.Structures.Catalogs Namespace